lhzloveyyj/FOC/stm32f103_FOC/电流环/.pack/Keil/STM32F1xx_DFP.2.3.0/RTE_Driver/OTG_STM32F10x_cl.h
// OTG_FS Host channel-x interrupt mask register (OTG_FS_HCINTMSKx)
#define  OTG_FS_HCINTMSKx_XFRCM             ((uint32_t)    1U       )
#define  OTG_FS_HCINTMSKx_CHHM              ((uint32_t)    1U  <<  1)
#define  OTG_FS_HCINTMSKx_STALLM            ((uint32_t)    1U  <<  3)
#define  OTG_FS_HCINTMSKx_NAKM              ((uint32_t)    1U  <<  4)
#define  OTG_FS_HCINTMSKx_ACKM              ((uint32_t)    1U  <<  5)
#define  OTG_FS_HCINTMSKx_TXERRM            ((uint32_t)    1U  <<  7)
#define  OTG_FS_HCINTMSKx_BBERRM            ((uint32_t)    1U  <<  8)
#define  OTG_FS_HCINTMSKx_FRMORM            ((uint32_t)    1U  <<  9)
#define  OTG_FS_HCINTMSKx_DTERRM            ((uint32_t)    1U  << 10)

// OTG_FS Host channel-x transfer size register (OTG_FS_HCTSIZx)
#define  OTG_FS_HCTSIZx_XFRSIZ_POS          ((uint32_t)           0U)
#define  OTG_FS_HCTSIZx_XFRSIZ_MSK          ((uint32_t)0x7FFFFU     )
#define  OTG_FS_HCTSIZx_XFRSIZ(x)          (((uint32_t)    x        ) & OTG_FS_HCTSIZx_XFRSIZ_MSK)
#define  OTG_FS_HCTSIZx_PKTCNT_POS          ((uint32_t)           19U)
#define  OTG_FS_HCTSIZx_PKTCNT_MSK          ((uint32_t)0x3FFU  << OTG_FS_HCTSIZx_PKTCNT_POS)
#define  OTG_FS_HCTSIZx_PKTCNT(x)          (((uint32_t)    x   << OTG_FS_HCTSIZx_PKTCNT_POS) & OTG_FS_HCTSIZx_PKTCNT_MSK)
#define  OTG_FS_HCTSIZx_DPID_POS            ((uint32_t)           29U)
#define  OTG_FS_HCTSIZx_DPID_MSK            ((uint32_t)    3U  << OTG_FS_HCTSIZx_DPID_POS)
#define  OTG_FS_HCTSIZx_DPID(x)            (((uint32_t)    x   << OTG_FS_HCTSIZx_DPID_POS) & OTG_FS_HCTSIZx_DPID_MSK)
#define  OTG_FS_HCTSIZx_DPID_DATA0          (OTG_FS_HCTSIZx_DPID(0U))
#define  OTG_FS_HCTSIZx_DPID_DATA2          (OTG_FS_HCTSIZx_DPID(1U))
#define  OTG_FS_HCTSIZx_DPID_DATA1          (OTG_FS_HCTSIZx_DPID(2U))
#define  OTG_FS_HCTSIZx_DPID_MDATA          (OTG_FS_HCTSIZx_DPID(3U))
#define  OTG_FS_HCTSIZx_DPID_SETUP          (OTG_FS_HCTSIZx_DPID(3U))

// OTG_FS device configuration register (OTG_FS_DCFG)
#define  OTG_FS_DCFG_DSPD_POS               ((uint32_t)           0U)
#define  OTG_FS_DCFG_DSPD_MSK               ((uint32_t)    3U       )
#define  OTG_FS_DCFG_DSPD(x)               (((uint32_t)    x        ) & OTG_FS_DCFG_DSPD_MSK)
#define  OTG_FS_DCFG_NZLSOHSK               ((uint32_t)    1U  <<  2)
#define  OTG_FS_DCFG_DAD_POS                ((uint32_t)           4U)
#define  OTG_FS_DCFG_DAD_MSK                ((uint32_t) 0x7FU  << OTG_FS_DCFG_DAD_POS)
#define  OTG_FS_DCFG_DAD(x)                (((uint32_t)    x   << OTG_FS_DCFG_DAD_POS) & OTG_FS_DCFG_DAD_MSK)
#define  OTG_FS_DCFG_PFIVL_POS              ((uint32_t)           11U)
#define  OTG_FS_DCFG_PFIVL_MSK              ((uint32_t)    3U  << OTG_FS_DCFG_PFIVL_POS)
#define  OTG_FS_DCFG_PFIVL(x)              (((uint32_t)    x   << OTG_FS_DCFG_PFIVL_POS) & OTG_FS_DCFG_PFIVL_MSK)

// OTG_FS device control register (OTG_FS_DCTL)
#define  OTG_FS_DCTL_RWUSIG                 ((uint32_t)    1U       )
#define  OTG_FS_DCTL_SDIS                   ((uint32_t)    1U  <<  1)
#define  OTG_FS_DCTL_GINSTS                 ((uint32_t)    1U  <<  2)
#define  OTG_FS_DCTL_GONSTS                 ((uint32_t)    1U  <<  3)
#define  OTG_FS_DCTL_TCTL_POS               ((uint32_t)           4U)
#define  OTG_FS_DCTL_TCTL_MSK               ((uint32_t)    7U  << OTG_FS_DCTL_TCTL_POS)
#define  OTG_FS_DCTL_TCTL(x)               (((uint32_t)    x   << OTG_FS_DCTL_TCTL_POS) & OTG_FS_DCTL_TCTL_MSK)
#define  OTG_FS_DCTL_SGINAK                 ((uint32_t)    1U  <<  7)
#define  OTG_FS_DCTL_CGINAK                 ((uint32_t)    1U  <<  8)
#define  OTG_FS_DCTL_SGONAK                 ((uint32_t)    1U  <<  9)
#define  OTG_FS_DCTL_CGONAK                 ((uint32_t)    1U  << 10)
#define  OTG_FS_DCTL_POPRGDNE               ((uint32_t)    1U  << 11)

// OTG_FS device status register (OTG_FS_DSTS)
#define  OTG_FS_DSTS_SUSPSTS                ((uint32_t)    1U       )
#define  OTG_FS_DSTS_ENUMSPD_POS            ((uint32_t)           1U)
#define  OTG_FS_DSTS_ENUMSPD_MSK            ((uint32_t)    3U  << OTG_FS_DSTS_ENUMSPD_POS)
#define  OTG_FS_DSTS_ENUMSPD(x)            (((uint32_t)    x   << OTG_FS_DSTS_ENUMSPD_POS) & OTG_FS_DSTS_ENUMSPD_MSK)
#define  OTG_FS_DSTS_EERR                   ((uint32_t)    1U  <<  3)
#define  OTG_FS_DSTS_FNSOF_POS              ((uint32_t)           8U)
#define  OTG_FS_DSTS_FNSOF_MSK              ((uint32_t)0x3FFFU << OTG_FS_DSTS_FNSOF_POS)
#define  OTG_FS_DSTS_FNSOF(x)              (((uint32_t)    x   << OTG_FS_DSTS_FNSOF_POS) & OTG_FS_DSTS_FNSOF_MSK)

// OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK)
#define  OTG_FS_DIEPMSK_XFRCM               ((uint32_t)    1U       )
#define  OTG_FS_DIEPMSK_EPDM                ((uint32_t)    1U  <<  1)
#define  OTG_FS_DIEPMSK_TOM                 ((uint32_t)    1U  <<  3)
#define  OTG_FS_DIEPMSK_ITTXFEMSK           ((uint32_t)    1U  <<  4)
#define  OTG_FS_DIEPMSK_INEPNMM             ((uint32_t)    1U  <<  5)
#define  OTG_FS_DIEPMSK_INEPNEM             ((uint32_t)    1U  <<  6)

// OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK)
#define  OTG_FS_DOEPMSK_XFRCM               ((uint32_t)    1U       )
#define  OTG_FS_DOEPMSK_EPDM                ((uint32_t)    1U  <<  1)
#define  OTG_FS_DOEPMSK_STUPM               ((uint32_t)    1U  <<  3)
#define  OTG_FS_DOEPMSK_OTEPDM              ((uint32_t)    1U  <<  4)

// OTG_FS device all endpoints interrupt register (OTG_FS_DAINT)
#define  OTG_FS_DAINT_IEPINT(in_ep)         ((uint32_t)((1U <<         in_ep)  & 0x0000FFFFU))
#define  OTG_FS_DAINT_OEPINT(out_ep)        ((uint32_t)((1U << (16U + out_ep)) & 0xFFFF0000U))

// OTG_FS device all endpoints interrupt mask register (OTG_FS_DAINTMSK)
#define  OTG_FS_DAINTMSK_IEPM(in_ep)        ((uint32_t)((1U <<         in_ep)  & 0x0000FFFFU))
#define  OTG_FS_DAINTMSK_OEPM(out_ep)       ((uint32_t)((1U << (16U + out_ep)) & 0xFFFF0000U))

// OTG_FS device Vbus discharge time register (OTG_FS_DVBUSDIS)
#define  OTG_FS_DVBUSDIS_VBUSDT_POS         ((uint32_t)           0U)
#define  OTG_FS_DVBUSDIS_VBUSDT_MSK         ((uint32_t)0xFFFFU      )
#define  OTG_FS_DVBUSDIS_VBUSDT(x)         (((uint32_t)    x        ) & OTG_FS_DVBUSDIS_VBUSDT_MSK)

